crud_image_app/app/controllers/masonry_controller.rb

  def index
    @masonry = Post.all
---
SELECT "posts".* FROM "posts"