app/controllers/posts_controller.rb

SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.order("title").page(params[:page]).per(5)

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "test"], ["created_at", Tue, 07 Jun 2016 08:36:34 UTC +00:00], ["title", "test"], ["updated_at", Tue, 07 Jun 2016 08:36:34 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = 13  [["title", "f12323123"], ["content", "dafsafsdaf"], ["updated_at", Thu, 09 Jun 2016 04:48:15 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)